#pragma once

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

// 時間取得 (ミリ秒単位)
long long int engineUtilTimeGet(void);

// ゲーム終了
void engineUtilSystemExit(void);

// ゲーム中止
#define engineUtilSystemError(info) do{trace("error %s", engineUtilMemoryInfo(info, __FILE__, __LINE__)); engineUtilSystemExit();}while(false)

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

