#pragma once

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------
// -------- ゲーム側で実装 プラットフォーム側から呼び出す

// url取得 返値文字列は解放禁止
char *gamePluginUtilUrlGet(void);

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------
// -------- プラットフォーム側で実装 ゲーム側から呼び出す

// プラットフォーム名取得 返値文字列は解放禁止
char *platformPluginUtilPlatformGet(void);
// ユーザーID取得 返値文字列は解放禁止
char *platformPluginUtilUidGet(void);

// unix時間取得
long long int platformPluginUtilTimeGet(void);

// 読み込み中確認
int platformPluginUtilIsLoading(void);

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------
// -------- プラットフォーム側で実装 プラットフォーム側から呼び出す

// 読み込み中カウンタ加算
void nativePluginUtilIncrementLoading(void);
// 読み込み中カウンタ減算
void nativePluginUtilDecrementLoading(void);

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

