#pragma once

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------
// -------- ゲーム側で実装 プラットフォーム側から呼び出す

// url取得 返値文字列は解放禁止
char *gamePluginUtilUrlGet(void);

// コールバック関数ポインタの登録
int gamePluginUtilCallbackSet(void *param, void(*callback)(void *param, void *buff, size_t size));
// コールバック関数の実行と解放
int gamePluginUtilCallbackCall(int callbackId, void *buff, size_t size);

// 揮発性一時バッファ 返値領域は解放禁止
void *gamePluginUtilTemporaryBuffer(size_t size);

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------
// -------- プラットフォーム側で実装 ゲーム側から呼び出す

// プラットフォーム名取得 返値文字列は解放禁止
char *platformPluginUtilPlatformGet(void);
// ユーザーID取得 返値文字列は解放禁止
char *platformPluginUtilUidGet(void);

// unix時間取得
long long int platformPluginUtilTimeGet(void);

// 読み込み中確認
int platformPluginUtilIsLoading(void);

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------
// -------- プラットフォーム側で実装 プラットフォーム側から呼び出す

// 読み込み中カウンタ加算
void nativePluginUtilIncrementLoading(void);
// 読み込み中カウンタ減算
void nativePluginUtilDecrementLoading(void);

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

